Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A21A.tmx
Source language: en_us
Languages: zh_cn

source: US school accused of using laptops to spy on pupils
zh_cn: 美国学校指控使用笔记本电脑对学生进行间谍活动

source: The row over a Philadelphia school district accused of secretly spying on pupils through laptop cameras escalated today after it acknowledged capturing more than 56,000 images of its students, many of them in their homes.
zh_cn: 对于费城教育局被指控该秘密地通过高级笔记本摄像头对学生进行间谍活动的争论今天增强了。因为他们已经承认取得了大约56000名学生的图像，图像中的他们大部分还在家里。

source: When the scandal first broke, it was believed that only a few pictures had been taken of one pupil, Blake Robbins.
zh_cn: 当这个丑闻刚开始爆发出来的时候，大家相信只有一个叫Blake Robbins的学生的少许照片被偷拍。

source: But court papers released this week showed that thousands of images were taken of Robbins and other students.
zh_cn: 但是法院文件本周发布的消息表示，Robbins和其他的学生们被偷拍了上千张照片。

source: Robbins and his parents have filed an action against the school district of Lower Merion in an affluent suburb of Philadelphia.
zh_cn: Robbins和他的父母已经对Lower Merion教育局提起了诉讼，这是一个费城富庶的郊区。

source: Court papers from the Robbins's lawyers said that at first it was thought that the laptops' "peeping tom" technology had produced a few images but they found more than 400 of Robbins, including images "showing him partially undressed and sleeping".
zh_cn: 从律师提供的法院文件看来，首先认为是笔记本电脑的偷窥摄像头提供了少许照片，但是后来他们发现了400多张Robbins的，其中包括那些“部分裸露的和睡觉的”。

source: There were images of other students in their homes as well.
zh_cn: 那里也有其他学生在家的图片。

source: "Not only was Blake Robbins being spied upon, but every one of the people he was IM [instant message] chatting with were spied upon," said Robbins's lawyer, Mark Haltzman.
zh_cn: “不仅是Blake Robbins被监视了，每一个与他即时聊天的人都没能幸免遇难。”Robbins的律师Mark Haltzman表示。

source: Henry Hockeimer, a lawyer for Harriton school which Robbins attended, revealed that at least 56,000 webcam pictures and other images were taken from students' laptops but he denied any were of a salacious nature.
zh_cn: Henry Hockeimer是Robbins所在Harriton学校的律师。他透露至少56000个摄像头图片和其他图片通过学生的笔记本电脑被拍摄，但他否认其中有任何下流的内容。

source: The school district issued 2,300 laptops to students and said it activated the spyware installed in them to try to track 80 that had gone missing.
zh_cn: 这所教育局发放了2300台笔记本电脑给学生，并表示激活了安装在里面的间谍软件以试图追踪80个遗失的电脑。

source: The system has now been deactivated.
zh_cn: 这个系统现在被关闭了。

source: The row began when Robbins was confronted in November by a school official suspicious that he may have had drugs in his bedroom and was shown a photograph taken from his laptop.
zh_cn: 这个争论开始于Robbins在十一月被学校官方怀疑他可能在卧室里藏匿毒品，并出示了一张通过他的笔记本拍摄的照片。

source: Robbins said the "pills" were sweets. He and his parents launched the case, claiming violation of civil rights.
zh_cn: Robbins说，那些“药片”其实是糖，他和他的父母开启了这个案子，声称公民权利受到了伤害。

source: Robbins said he did not know why the spying device was activated as his laptop had not been reported stolen or missing.
zh_cn: Robbins说在他的笔记本没有报告被偷窃或是丢失时，他不知道他里面的间谍系统被激活了。

source: Other students, whose pictures were taken said their laptops had not been reported stolen or missing either.
zh_cn: 其他被拍了照片学生也说他们的笔记本没有报告被偷窃或是丢失。

source: The FBI is investigating the scandal and the Senate is to look at proposed legislation that would make it a crime to use webcams for spying.
zh_cn: FBI正在调查这件丑闻，参议院也准备立法来给利用摄像头的间谍行为定罪。

source: An administrator at the school, one of the few with authority to track the laptops, was refusing to answer questions, citing her constitutional right to remain silent.
zh_cn: 一个学校的管理者，作为几个跟踪摄像头的工作人员之一，拒绝回答问题，依据是他保持沉默的权利。

source: The Philadelphia Inquirer reported that 38,500 of the images came from six laptops that had been reported missing from the Harriton gym in September 2008.
zh_cn: 费城的报告员报道，这些图片中的38500张来自六台据报告在2008年九月在Harriton运动馆丢失的笔记本。

source: Another set of images were from cameras in laptops which employees responsible for tracking failed or forgot to turn off.
zh_cn: 另外一组图片来自那些相关负责人员的的追寻失败或者忘记关闭的笔记本的摄像头。

source: In about 15 cases, it has not yet been established why the machines were being monitored.
zh_cn: 在大约15个案例里，还没有确定为什么这些机器被监控。

source: In a few other cases, images taken have not been recovered.
zh_cn: 在几个其他的案例里，被拍摄的图片还没有恢复。

source: Hockeimer said a tracking programme in the devices automatically took images every 15 minutes, usually capturing a photo of the user and a screen shot at the same time.
zh_cn: Hockeimer说，一个在自动设备里的追踪程序每15分钟就拍摄图片，捕捉一张使用者的照片和一次抓屏经常在同一时间。

source: The programme was sometimes turned on for weeks or months at a time, Hockeimer said.
zh_cn: 这个程序有时一次打开几星期或者几个月，Hockeimer说。

source: "There were no written policies or procedures governing the circumstances surrounding activating the program and the circumstances regarding turning off the activations," he said.
zh_cn: “没有任何成文的政策或程序管理激活这些程序和关于关掉激活的环境。”他说。

source: The court papers, filed by Robbins' lawyers, said that the technology was activated between 20 October and 4 November last year, with most of the 400 shots of him while he was in his home, and included his family.
zh_cn: Robbins的律师填写的法律文件里，提到这个技术在去年10月20日到11月4日里被激活，在他在家的时候，拍摄了400张他的照片，包括他的家庭。

source: "There were additional webcam pictures and screen shots taken of Blake Robbins which, to date, have not been recovered because the evidence was purged by the IT department," the court papers say.
zh_cn: “迄今为止，还有内容为Blake Robbins的附加的摄像头图片和抓屏没有被复原，因为证据被IT部门净化了。”文件提到。

source: His lawyers are trying to obtain access to the administrator's home computer to establish whether she downloaded any of the pictures.
zh_cn: 他的律师在试图取得进入管理者家庭电脑来弄清是否她下载了这些图片。

source: The court papers allege she may be a voyeur.
zh_cn: 法庭文件宣称她可能是一个偷窥狂。

source: In one email, when an IT person commented on how the viewing of the webcam pictures and screen shots from a student's computer was like a "little LMSD (Lower Merion School District) soap opera", she allegedly replied: "I know, I love it."
zh_cn: 在一封电子邮件里，当一个IT人如何评论从一个学生的电脑观看摄像头拍摄的图片和屏幕像一出小Lower Merion学校的肥皂剧时，据称，她回答：“我知道，我喜欢这个。”
